Revit 2027 API
ForgeTypeId.StrictlyEquals Method
 Returns true if the entire typeid string held by this ForgeTypeId is exactly equal to that held by the given ForgeTypeId. For the default equality comparison used by the equality operator (==), see NameEquals(ForgeTypeId).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool StrictlyEquals(
	ForgeTypeId other
)
Public Function StrictlyEquals (
	other As ForgeTypeId
) As Boolean
public:
bool StrictlyEquals(
	ForgeTypeId^ other
)
member StrictlyEquals :
        other : ForgeTypeId -> bool
Parameters
other ForgeTypeId
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ForgeTypeId Class
Autodesk.Revit.DB Namespace